socialNetwork/results/scaling-on-bench1.5-may6/benchmark1.5-05-06-26_110229/st5-AttUpd/1000.txt
Running 2m test @ http://128.105.146.159:80
  16 threads and 128 connections

  Thread calibration: mean lat.: 4569.307ms, rate sampling interval: 12951ms
  Thread calibration: mean lat.: 4690.314ms, rate sampling interval: 13328ms
  Thread calibration: mean lat.: 4718.260ms, rate sampling interval: 13606ms
  Thread calibration: mean lat.: 4695.695ms, rate sampling interval: 13443ms
  Thread calibration: mean lat.: 4788.474ms, rate sampling interval: 13197ms
  Thread calibration: mean lat.: 4575.976ms, rate sampling interval: 13082ms
  Thread calibration: mean lat.: 4708.875ms, rate sampling interval: 13295ms
  Thread calibration: mean lat.: 4635.516ms, rate sampling interval: 12869ms
  Thread calibration: mean lat.: 4669.708ms, rate sampling interval: 13033ms
  Thread calibration: mean lat.: 4519.351ms, rate sampling interval: 12951ms
  Thread calibration: mean lat.: 4850.596ms, rate sampling interval: 13557ms
  Thread calibration: mean lat.: 4834.984ms, rate sampling interval: 13606ms
  Thread calibration: mean lat.: 4518.082ms, rate sampling interval: 12640ms
  Thread calibration: mean lat.: 4488.232ms, rate sampling interval: 12681ms
  Thread calibration: mean lat.: 4261.000ms, rate sampling interval: 11919ms
  Thread calibration: mean lat.: 4651.018ms, rate sampling interval: 13139ms

-----------------------------------------------------------------------
Test Results @ http://128.105.146.159:80 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    11.42s     9.10s   27.85s    49.80%
    Req/Sec    65.44     29.92   138.00     60.47%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.25s 
 75.000%   19.53s 
 90.000%   23.25s 
 99.000%   27.85s 
 99.900%   30.92s 
 99.990%   31.93s 
 99.999%   32.95s 
100.000%   33.00s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      10.815     0.000000            1         1.00
      14.743     0.100000        11604         1.11
      19.247     0.200000        23150         1.25
    2469.887     0.300000        34712         1.43
    8318.975     0.400000        46283         1.67
   12247.039     0.500000        57858         2.00
   14000.127     0.550000        63658         2.22
   15450.111     0.600000        69449         2.50
   16875.519     0.650000        75209         2.86
   18300.927     0.700000        81025         3.33
   19529.727     0.750000        86835         4.00
   20054.015     0.775000        89748         4.44
   20643.839     0.800000        92564         5.00
   21282.815     0.825000        95468         5.71
   21970.943     0.850000        98388         6.67
   22577.151     0.875000       101261         8.00
   22921.215     0.887500       102716         8.89
   23248.895     0.900000       104157        10.00
   23625.727     0.912500       105611        11.43
   24035.327     0.925000       107063        13.33
   24395.775     0.937500       108476        16.00
   24641.535     0.943750       109227        17.78
   24887.295     0.950000       109923        20.00
   25165.823     0.956250       110660        22.86
   25477.119     0.962500       111389        26.67
   25804.799     0.968750       112113        32.00
   25985.023     0.971875       112454        35.56
   26214.399     0.975000       112814        40.00
   26427.391     0.978125       113206        45.71
   26689.535     0.981250       113549        53.33
   27049.983     0.984375       113912        64.00
   27213.823     0.985938       114080        71.11
   27410.431     0.987500       114265        80.00
   27688.959     0.989062       114453        91.43
   27983.871     0.990625       114625       106.67
   28327.935     0.992188       114798       128.00
   28475.391     0.992969       114895       142.22
   28671.999     0.993750       114981       160.00
   28934.143     0.994531       115070       182.86
   29376.511     0.995313       115161       213.33
   29753.343     0.996094       115253       256.00
   29949.951     0.996484       115297       284.44
   30048.255     0.996875       115342       320.00
   30162.943     0.997266       115386       365.71
   30343.167     0.997656       115434       426.67
   30539.775     0.998047       115482       512.00
   30621.695     0.998242       115498       568.89
   30703.615     0.998437       115522       640.00
   30785.535     0.998633       115554       731.43
   30851.071     0.998828       115566       853.33
   30932.991     0.999023       115590      1024.00
   31031.295     0.999121       115600      1137.78
   31113.215     0.999219       115612      1280.00
   31211.519     0.999316       115625      1462.86
   31260.671     0.999414       115638      1706.67
   31309.823     0.999512       115645      2048.00
   31342.591     0.999561       115651      2275.56
   31391.743     0.999609       115656      2560.00
   31539.199     0.999658       115662      2925.71
   31621.119     0.999707       115668      3413.33
   31703.039     0.999756       115673      4096.00
   31735.807     0.999780       115676      4551.11
   31768.575     0.999805       115679      5120.00
   31834.111     0.999829       115684      5851.43
   31850.495     0.999854       115685      6826.67
   31899.647     0.999878       115688      8192.00
   31932.415     0.999890       115689      9102.22
   31981.567     0.999902       115690     10240.00
   32014.335     0.999915       115692     11702.86
   32178.175     0.999927       115693     13653.33
   32194.559     0.999939       115694     16384.00
   32391.167     0.999945       115695     18204.44
   32555.007     0.999951       115696     20480.00
   32571.391     0.999957       115697     23405.71
   32571.391     0.999963       115697     27306.67
   32686.079     0.999969       115698     32768.00
   32686.079     0.999973       115698     36408.89
   32751.615     0.999976       115699     40960.00
   32751.615     0.999979       115699     46811.43
   32751.615     0.999982       115699     54613.33
   32948.223     0.999985       115700     65536.00
   32948.223     0.999986       115700     72817.78
   32948.223     0.999988       115700     81920.00
   32948.223     0.999989       115700     93622.86
   32948.223     0.999991       115700    109226.67
   32997.375     0.999992       115701    131072.00
   32997.375     1.000000       115701          inf
#[Mean    =    11418.378, StdDeviation   =     9098.357]
#[Max     =    32980.992, Total count    =       115701]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  118799 requests in 2.00m, 1.69GB read
  Non-2xx or 3xx responses: 1
Requests/sec:    990.17  
Transfer/sec:     14.41MB